{"blogs" : [
    {
        "id": 1001,
        "name": "Safari Kid International Is Now Kido",
        "intro": "<div class='news-plain-text-box'><p>We are pleased to announce that on 1st July, 2020 <strong>Safari Kid International is rebranding its Dubai and Hong Kong schools.</strong></p><p>Our nurseries and preschools will now operate under the name Kïdo in the UAE and Hong Kong, in line with our nurseries in the UK and preschools in the USA as part of our Kïdo Holdings Group (<a href='https://www.kido.education/'>www.kido.education</a>). Our India centres will continue to run under the Safari Kid name.</p><p>Our excellent teams in all our nurseries and preschools in Dubai and Hong Kong remain the same.</p><p><strong>Kïdo (pronounced kee-doh) is the Japanese word for luminance.</strong> This new brand is a more accurate reflection of our vision – we believe that school should be a place to light up a child’s imagination and creativity. Everything we do is designed to ignite and magnify their passions.</p><p>We have already been running our proprietary teaching system, the Kïdo Early Years Program in Dubai and Hong Kong for over a year, blending the best insights from multiple philosophies, such as Montessori, Reggio Emilia and Multiple Intelligences.</p><p>The program covers a range of subjects, including literacy, maths, science and art, and uses thinking and problem-based learning to help children develop a diverse set of skills.</p><p>In a world where we can all access the same information through our smartphones, we want children to move beyond the obvious and have the ability to leverage knowledge and apply it in innovative ways to solve complex problems.</p><p>The Kïdo Early Years Program uses an enhancement of the British EYFS as an observation and assessment framework, adding new learning methods and areas of development. We also introduce development goals in areas such as the arts, technology, coding and robotics, as well as specific goals in literacy and mathematics.</p><p>Our curriculum was developed in-house by <strong>Thasin Rahim, our Chief Academic Officer</strong>, who lives in London and is also a Kïdo mum.<br> Thasin has an extensive background in early years education: in addition to Master’s Degrees in neuroscience, psycho-pedagogy and other disciplines, she is also a former teacher and nursery manager, who was nominated for the Varkey Foundation’s Global Teacher of the Year in 2016.Thasin is also part of our new panel of Curriculum Advisors, whose work inspired some of the thinking behind the <strong><a href='https://kido.school/en/programs/' rel='noopener' target='_blank'>Kïdo Early Years Programme</a></strong>. These advisors will continue to assist us over the next few years.</p><p><strong>Dr. Robert Swartz </strong><br> Robert is Director of the National Center for Teaching Thinking, USA. He received his doctorate from Harvard University and is an emeritus faculty member at the University of Massachusetts at Boston. He is currently a member of the organising committee of the International Conference on Thinking (ICOT).</p><p>Robert is the co-author of Infusing Critical and Creative Thinking into Content Instruction, a series of lesson design handbooks, as well as the lead author of Thinking-Based Learning. His work is a core part of our thinking-based approach to the Kïdo curriculum.</p><p><strong>Dr. Yuuko Tonkovich</strong><br> Yuuko is the Associate Editor of the academic journal Applied Psycholinguistics. She received her doctorate from Harvard University and was a finalist for the International Reading Association Outstanding Dissertation of the Year, 2005.</p><p>Yuuko advises us on developing high-performing bilingual programmes for use in the early years.</p><p>As a sign of our commitment to the UK, <strong>Aniruddh Gupta, our Founder and Global CEO,</strong> moved to London with his family in July. The UK’s capital is now the international headquarters of the group.</p><p>We are also pleased to announce that we are franchising our offering across the United Kingdom and the rest of the world. Our franchise product includes branding and marketing, recruitment and training support, as well as our curriculum. It also includes our in-house, proprietary nursery management software system – iKïdo.</p></div>",
        "img": "https://kido.school/wp-content/uploads/2020/07/Learning-and-Developement-1-1024x512-1-800x505.jpg",
        "slug": "safari-kid-international-is-now-kido",
        "date": "July 1st"
    },
    {
        "id": 1002,
        "name": "Do’s And Don’ts- During Isolation",
        "intro": "<div class='news-plain-text-box'><p><span style='text-decoration: underline;'><strong>Talking about Coronavirus</strong></span></p><p><strong>Do answer their questions</strong></p><p><span style='color: #000000;'>Most children under the age of four won’t fully understand what this whole thing is all about. However, if they do ask questions, explain the situation to them according to their capabilities. Give them the fundamental guidelines for taking care of themselves, using a vocabulary that is easy for them to understand.</span></p><p><strong>Don’t confuse them</strong></p><p><span style='color: #000000;'>Avoid using technical terms like ‘pandemic’ or ‘epidemiology’.</span></p><p><span style='color: #000000;'>Speak to them calmly and clearly – providing an overabundance of information will only end up confusing them.</span></p><p><strong>Do your research</strong></p><p><span style='color: #000000;'>Before speaking to your children, make sure you consult reliable sources for information. If there’s something that you don’t know, it is better to admit it than lying or misinforming about it. The truth is that there are some things we will only know when there’s more information available.</span></p><p><strong>Don’t send the wrong message</strong></p><p><span style='color: #000000;'>Try not to highlight that the virus comes from China, or that it is associated with certain types of places. Doing so might result in you sending a confusing, potentially racist and incorrect message about the situation.</span></p><p><strong>Working and Learning Environment</strong></p><p><strong>Do organize your house</strong></p><p><span style='color: #000000;'>Take the time to modify certain areas of your home. You will want your own space that can act as your office, while your children will need an area to function as their classroom. Natural light and plants will encourage a calm, healthy atmosphere, while making water and healthy snacks available will help break up the day.</span></p><p><strong>Don’t work where you sleep</strong></p><p><span style='color: #000000;'>Try and avoid working in your bedroom if you can. This goes for your kids too. If it’s possible, make sure their classes are in a different part of the house.</span></p><p><span style='text-decoration: underline;'><strong>Home Activities</strong></span></p><p><strong>Do set targets</strong></p><p><span style='color: #000000;'>Ensure every activity you give your child has a final goal or purpose. This will prevent unnecessary anxiety or uncertainty within your children.</span></p><p><span style='color: #000000;'>Free-play or open-ended activities will not have final objectives, but if we are working on a project such as planning a vacation or doing some crafts, highlight what the final intention may be. As usual, the focus should be placed on the process and not necessarily in the final result.</span></p><p><strong>Don’t just “leave them to it”</strong></p><p><span style='color: #000000;'>If your child is doing an e-learning activity from school, or if they have been assigned some homework, don’t ignore them.</span></p><p><span style='color: #000000;'>Instead, spend a few minutes at the beginning and the end of the task, to better understand what they should be doing. Discuss with your children if the desired result was achieved and if they properly understood what they were doing.</span></p><p>Lastly Stay Safe Stay Healthy and Stay Home!</p><p><img loading='lazy' src='https://cdn.shortpixel.ai/client/q_glossy,ret_img,w_164,h_164/https://kido.school/wp-content/uploads/2019/08/thasin-rahim.jpeg' width='164' height='164' data-pagespeed-url-hash='2329939632'></p><p>By Thasin Rahim (Chief Curriculum Officer)</p></div>",
        "img": "https://kido.school/wp-content/uploads/2020/03/Adventurers-shutterstock_319022582-800x505.jpg",
        "slug": "dos-and-donts-during-isolation",
        "date": "March 27th"
    },
    {
        "id": 1003,
        "name": "Tips For Preschool Home-Schooling",
        "intro": "<div class='news-plain-text-box'><p><span style='color: #000000;'>As we all know, the world has come to a halt for a brief moment. However, even during these unpredictable times, it is vital that children continue their learning journeys. This is where home-schooling comes into play.</span></p><p><span style='color: #000000;'>To help your child adjust to this new way of learning, we’ve taken the time to outline some basic home-schooling structures and guidelines.</span></p><p><span style='color: #000000;'><strong>1) Stick to a routine</strong></span></p><p><span style='color: #000000;'>Set a clear schedule, as if your children were still going to school. Establish start and end times for each activity, and allocate some moments for rest and playtime.</span></p><p><span style='color: #000000;'>This extents to outside “school hours” as well. Keep the habit of eating breakfast, lunch and dinner together. Being at home lets us spend more time with our children and we take advantage of the opportunity.</span></p><p><span style='color: #000000;'>Divide the different activities into 25 to 30-minute chunks, followed by a 5 to 10-minute rest period. This helps their concentration and reduces the stress of transitioning from one task to the next. You can use the break times to call family members or friends.</span></p><p><span style='color: #000000;'><strong>2) Maximize your time</strong></span></p><p><span style='color: #000000;'>Your time in isolation is a great opportunity to learn something new as a family. Set aside 30 minutes of your day to perform an activity with your children. An example could be learning a language, a new skill (such as cooking) or planning your next vacation. The last activity will also help children realize that this is only a temporary situation.</span></p><p><span style='color: #000000;'>If you’re working from home and your company is flexible with your working hours, you can set up work for a few hours during the day, then continue when the children are asleep.</span></p><p><span style='color: #000000;'><strong>3) Set a good example</strong></span></p><p><span style='color: #000000;'>Don’t forget to keep a healthy daily routine for yourself too. Make sure to shower, dress, and tidy up your space like you would any other day of the week. This helps children maintain a sense of stability and responsibility towards their role within the family, and how the “small things” still matter.</span></p><p><img loading='lazy' src='https://cdn.shortpixel.ai/client/q_glossy,ret_img,w_127,h_127/https://kido.school/wp-content/uploads/2019/08/thasin-rahim.jpeg' width='127' height='127' data-pagespeed-url-hash='2972084146'></p><p>By Thasin Rahim (Chief Curriculum Officer)</p></div>",
        "img": "https://kido.school/wp-content/uploads/2020/03/Discoverers-shutterstock_515137921-800x505.jpg",
        "slug": "tips-for-preschool-home-schooling",
        "date": "March 27th"
    },
    {
        "id": 1004,
        "name": "Supporting children during a school closure",
        "intro": "<div class='news-plain-text-box'><h2><span style='color: #000000;'><strong>Supporting children during a school closure</strong></span></h2><p><span style='color: #000000;'>Children can pick up on your behaviors and fears, so it’s important to show courage and strength during difficult times. With the current outbreak across the world, anxiety levels have increased and this can unsettle children.&nbsp;</span></p><p><span style='color: #000000;'>Here are a few tips on how we can create a positive environment during times of stress.</span></p><h2><span style='color: #000000;'>1) Routine</span></h2><p><span style='color: #000000;'>As the children have been out of school, it is a good idea to implement a structured routine at home which will provide them with some normalcy. When creating the routine, explain it to the children or come up with some of the rules together to make them feel involved. </span></p><p><span style='color: #000000;'>You can apply this directly to their hygiene habits. For example, at school, children need to wash their hands before eating snacks or lunch. At home, the children should have a routine of going to the bathroom to wash their hands before any meal. This will not only improve their hygiene but it can help with moods, sleep patterns and appetite.</span></p><h2><span style='color: #000000;'>2) Correct hand washing techniques</span></h2><p><span style='color: #000000;'>It is important to model the correct way to wash your hands. Children will be more willing to take their time washing their hands if you are doing it with them.&nbsp; Take time to explain the different parts of the hands you are washing with the child, explain that if they sing the ABC song, by the time they are finished singing they will have washed their hands properly.</span></p><p><span style='color: #000000;'>When washing your hands, it is important to make sure you wash the following areas: the palms, the back of the hands, in between the fingers, the nailbeds on each finger, the thumbs and the wrists. Try to make it fun and sing with the children to keep them interested.</span></p><h2><span style='color: #000000;'>3) Explaining, sharing and informing</span></h2><p><span style='color: #000000;'>Children are curious. They enjoy asking questions and learning information, even more so when they are asked to do something. It is important to validate their questions and curiosity with age appropriate information. Informing children about why they should wash their hands and why they should wear masks is a good way for them to follow your lead and actions.&nbsp; Simply telling them to just wear a mask can sometimes feel like a losing battle, but if they understand why, they may be more encouraged to do what is asked. Be prepared to answer questions at any time as they may take a while to process the information.&nbsp;</span></p><h2><span style='color: #000000;'>4) Emotional support</span></h2><p><span style='color: #000000;'>It is important to check in on the children and make sure they feel safe and supported. Listening to their fears and misunderstandings can be a great way to make them feel safe and comfortable with the situation. Be positive and acknowledge their feelings to make them feel heard.&nbsp;</span></p><p><img loading='lazy' src='https://cdn.shortpixel.ai/client/q_glossy,ret_img,w_114,h_152/https://kido.school/wp-content/uploads/2020/03/Krystal-Raath.jpeg' width='114' height='152' data-pagespeed-url-hash='1698868241'></p><p>By Krystal Raath</p></div>",
        "img": "https://kido.school/wp-content/uploads/2020/03/News-1-Header-500x316.jpg",
        "slug": "supporting-children-during-a-school-closure",
        "date": "March 27th"
    }
]
}